'''
На вход программе подается натуральное число, записанное в десятичной системе счисления. Напишите программу, которая переводит данное число в двоичную систему счисления.

Формат входных данных
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести число записанное в двоичной системе счисления.

Тестовые данные 🟢
Sample Input 1:

5
Sample Output 1:

101
Sample Input 2:

128
Sample Output 2:

10000000
'''


n, s = int(input()), ""
while n > 0:
    if n % 2 == 1:
        s = s + "1"
    else:
        s = s + "0"
    n //= 2
for i in range(len(s) - 1, -1, -1):
    print(s[i], end="")
