'''
На вход программе подается одна строка. Напишите программу, которая определяет сколько раз в строке встречаются символы + и *.

Формат входных данных
На вход программе подается одна строка.

Формат выходных данных
Программа должна вывести сколько раз встречаются символы  + и * в строке.

Тестовые данные 🟢
Sample Input:

bcd+a++++**31415
Sample Output:

Символ + встречается 5 раз
Символ * встречается 2 раз
'''


s, pl, pr = input(), 0 , 0
for i in range(len(s)):
    if s[i] == "+":
        pl += 1
    elif s[i] == "*":
        pr += 1
print("Символ + встречается", pl, "раз")
print("Символ * встречается", pr, "раз")
