'''
На вход программе подается одна строка. Напишите программу, которая выводит сообщение «Цифра» (без кавычек), если строка содержит цифру. 
В противном случае вывести сообщение «Цифр нет» (без кавычек).

Формат входных данных
На вход программе подается одна строка.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Тестовые данные 🟢
Sample Input 1:

Hi Python
Sample Output 1:

Цифр нет
Sample Input 2:

Hi 17 Python
Sample Output 2:

Цифра
'''


s, flag = input(), True
for i in range(len(s)):
    if s[i] in "0123456789":
        print("Цифра")
        flag = False
        break
if flag != False:
    print("Цифр нет")
