'''
Геометрической прогрессией называется последовательность чисел b_1, b_2, ... b_n, каждое из которых, начиная с b_2b, получается из предыдущего умножением 
на одно и то же постоянное число qq (знаменатель прогрессии), то есть
b_n=b_{n−1}*q
Если известен первый член прогрессии и её знаменатель, то nn-ый член геометрической прогрессии находится по формуле
b_n=b_1*q^{n-1}
Входные данные
На вход программе подаётся три целых числа: b_1, q и n, каждое на отдельной строке.

Выходные данные
Программа должна вывести nn-ый член геометрической прогрессии.

Тестовые данные 🟢
Sample Input 1:

1
2
5
Sample Output 1:

16
Sample Input 2:

10
-2
6
Sample Output 2:

-320
Sample Input 3:

-2
10
3
Sample Output 3:

-200
'''


print(int(input()) * int(input()) ** (int(input()) - 1))
