'''
Напишите программу, вычисляющую значение ⌈x⌉ + ⌊x⌋ по заданному вещественному числу x.

Формат входных данных
На вход программе подается одно вещественное число x.

Формат выходных данных
Программа должна вывести одно число – значение указанного выражения.

Примечание. ⌈x⌉ – потолок числа, ⌊x⌋ – пол числа.

Тестовые данные 🟢
Sample Input 1:

5.5
Sample Output 1:

11
Sample Input 2:

5.4
Sample Output 2:

11
Sample Input 3:

-12.2
Sample Output 3:

-25
'''


from math import ceil, floor

x = float(input())
print(ceil(x) + floor(x))
