'''
Даны три вещественных числа aa, bb, cc. Напишите программу, которая находит вещественные корни квадратного уравнения 
ax^2 + bx + c = 0.

Формат входных данных
На вход программе подается три вещественных числа a!=0, b, c, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести вещественные корни уравнения если они существуют или текст «Нет корней» в противном случае.

Примечание. Если уравнение имеет два корня, то следует вывести их в порядке возрастания.

Тестовые данные 🟢
Sample Input 1:

1
2
1
Sample Output 1:

-1.0
Sample Input 2:

1
-7.5
3
Sample Output 2:

0.4239663260874824
7.076033673912518
'''


a, b, c = float(input()), float(input()), float(input())
d = b ** 2 - 4 * a * c
if d < 0:
    print("Нет корней")
elif d == 0:
    print(-b / 2 / a)
else:
    print(min((-b + d ** 0.5)/ 2 / a, (-b - d ** 0.5)/ 2 / a))
    print(max((-b + d ** 0.5)/ 2 / a, (-b - d ** 0.5)/ 2 / a))
