'''
Правильный многоугольник — выпуклый многоугольник, у которого равны все стороны и все углы между смежными сторонами. 
Площадь правильного многоугольника с длиной стороны aa и количеством сторон nn вычисляется по формуле: 
S = (n*a^2)/(4tg(pi/n))

 
Даны два числа: натуральное число nn и вещественное число aa. Напишите программу, которая находит площадь указанного правильного многоугольника.

Формат входных данных
На вход программе подается два числа n и a, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести вещественное число – площадь многоугольника.

Тестовые данные 🟢
Sample Input:

3
2.0
Sample Output:

1.7320508075688779
'''


from math import tan, pi

n, a = float(input()), float(input())
print(n * a ** 2 / 4 / tan(pi / n))
