'''
Дано натуральное число n. Напишите программу, которая печатает численный треугольник с высотой равной n, в соответствии с примером:

1
121
12321
1234321
123454321
...
Формат входных данных
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести треугольник в соответствии с условием.

Примечание. Используйте вложенный цикл for.

Тестовые данные 🟢
Sample Input 1:

2
Sample Output 1:

1
121
Sample Input 2:

3
Sample Output 2:

1
121
12321
Sample Input 3:

5
Sample Output 3:

1
121
12321
1234321
123454321
'''


n = int(input())
for i in range(n):
    for j in range(1, i + 1):
        print(j, end="")
    for j in range(i + 1, 0, -1):
        print(j, end="")
    print()
