'''
Напишите программу, которая считывает три строки по очереди, а затем выводит их в обратной последовательности, каждую на отдельной строчке.

Формат входных данных
На вход программе подается три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке.

Примечание. Используйте 3 переменные для сохранения введённых строк текста.

Тестовые данные 🟢
Sample Input 1:

Hello
it's
me
Sample Output 1:

me
it's
Hello
Sample Input 2:

I love
Python
so much
Sample Output 2:

so much
Python
I love
'''

one, two, three = input(), input(), input()
print(three, two, one, sep="\n")
