'''
Напишите программу, которая считывает три строки по очереди, а затем выводит их в той же последовательности, каждую на отдельной строчке.

Формат входных данных
На вход программе подаются три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в той же последовательности, каждую на отдельной строке.

Примечание. Для считывания текста используйте команду input(), для печати текста на экране используйте команду print().

Тестовые данные 🟢
Sample Input 1:

I was
born
this way
Sample Output 1:

I was
born
this way
Sample Input 2:

I love
Python
so much
Sample Output 2:

I love
Python
so much
'''

print(input())
print(input())
print(input())
